{
  "name": "Daniel Sherman",
  "title": "Senior Software Engineer",
  "profile": {
    "lead": "A versitile software engineer with a strong science and math background.",
    "description": {
      "paragraphs":["Hi, my name is Daniel. I'm a software engineer who enjoys creating rich, beautiful, and performant user experiences on the front-end and working with modern back-end application architecture at scale.", "I have deep fullstack experience and many years of experience with modern frameworks such as node.js, react, and redux. I'm comfortable working in agile environments with CI/CD and working with other engineers of all stripes and backgrounds, including mentoring junior developers."]
    },
    "strengths":[
      "Skills and experience to take a project from conception through design to production and leave a clean, maintainable codebase that will generate value for many years to come.",
      "5 years of experience with react and redux, building extremely large and complex front end applications. Well versed in modern front-end architecture and patterns.",
      "Comfortable working on the backend with significant experience in microservice architecture, object-oriented programming, and RESTful APIs. I've been given the unofficial title of SQL wizard.",
      "I enjoy mentoring junior engineers and leading the charge on style and code quality standards and practices of the team.",
      "Imagination and passion to think outside the box and contribute to the big picture."
    ]
  },
  "experience": {
    "lead": "\"In wisdom gathered over time I have found that every experience is a form of exploration.\"",
    "quoteBy": "- Ansel Adams",
    "experienceList": [
      {
        "company": "Tempus",
        "date": "2017-present",
        "description": {
          "paragraphs": ["At Tempus, I led front-end development on a greenfield project to build a next-generation sequencing web platform. After 9 months of development and ~200k lines of code, we successfully launched into a high-throughput lab with zero downtime.", "I also worked to scale up a groundbreaking platform that collects, structures, and analyzes clinical and genomic data at scale to generate therapeutic insight."]
        }
      }, 
      {
        "company": "Phigenics LLC",
        "date": "2010-2017",
        "description": {
          "paragraphs": ["At Phigenics, I helped pioneer a revolutionary water management saas platform currently in use in hundreds of hospitals, universities, and retail stores across the country.", "Following the success of the water management platform, I created and lead development on a remote water quality sensor system now used to monitor water quality in large facilities across the United States.", "I designed and developed a Laboratory Information Management System (LIMS) in use in multiple labs in the US and internationally, responsible for processing hundreds of thousands of samples and generating reports for hundreds of customers.", "On the backend, I built out a highly available and scalable architecture on AWS using technologies such as EC2, ECS/Docker, S3, SES, and CloudFront."]
        },
        "links": [
          {
            "url": "https://phigenics.com",
            "text": "Phigenics"
          }
        ]
      }
    ]
  },
  "skills": {
    "lead": "\"Learning never exhausts the mind.\"",
    "quoteBy": "- Leonardo da Vinci",
    "skillList": {
      "programming": [
        {
          "name": "Javascript",
          "percent": 100,
          "image": "javascript.png"
        }, {
          "name": "React.js",
          "percent": 100,
          "image": "react.png"
        }, {
          "name": "Node.js",
          "percent": 100,
          "image": "node.png"
        }, {
          "name": "C#/ASP.net",
          "percent": 100
        }, {
          "name": "HTML5",
          "percent": 100,
          "image": "html5.png"
        }, {
          "name": "CSS3",
          "percent": 100,
          "image": "css3.png"
        }, {
          "name": "Bootstrap",
          "percent": 100,
          "image": "bootstrap.png"
        }, {
          "name": "SQL",
          "percent": 100,
          "image": "sql.png"
        }, {
          "name": "Redux",
          "percent": 70,
          "image": "redux.png"
        }, {
          "name": "NoSQL",
          "percent": 80,
          "image": "mongo.png"
        }
      ],
      "devops": [
        {
          "name": "Amazon AWS",
          "percent": 100,
          "image": "aws.png"
        }, {
          "name": "TravisCI",
          "percent": 100,
          "image": "travis.png"
        }, {
          "name": "Github",
          "percent": 100,
          "image": "github.png"
        }, {
          "name": "Linux",
          "percent": 100,
          "image": "linux.png"
        }, {
          "name": "IIS",
          "percent": 100,
          "image": "iis.png"
        }, {
          "name": "Test Tools",
          "percent": 100,
          "image": "test.png"
        }
      ]
    }
  },
  "contact": {
    "lead": "\"Hey, I just met you and this is crazy, but here's my number, so call me maybe\"",
    "quoteBy": "- Carly Rae Jepson",
    "text": "Feel free to reach out if you are a fellow programmer, have an interesting product/employment opportunity, or if you just want to challenge me to a game of foosball. :)",
    "phone": "773-551-3085",
    "email": "dsherman.me@gmail.com"
  }
}
